In [2]:
%load_ext sql

In [4]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [3]:
%%sql
CREATE TABLE [Order_Tbl](
 [ORDER_DAY] date,
 [ORDER_ID] varchar(10) ,
 [PRODUCT_ID] varchar(10) ,
 [QUANTITY] int ,
 [PRICE] int 
)

 * sqlite:///./test.db
Done.

[]

In [4]:
%%sql
INSERT INTO [Order_Tbl]  VALUES ('2015-05-01','ODR1', 'PROD1', 5, 5);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-01','ODR2', 'PROD2', 2, 10);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-01','ODR3', 'PROD3', 10, 25);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-01','ODR4', 'PROD1', 20, 5);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-02','ODR5', 'PROD3', 5, 25);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-02','ODR6', 'PROD4', 6, 20);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-02','ODR7', 'PROD1', 2, 5);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-02','ODR8', 'PROD5', 1, 50);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-02','ODR9', 'PROD6', 2, 50);
INSERT INTO [Order_Tbl]  VALUES ('2015-05-02','ODR10','PROD2', 4, 10);

 * sqlite:///./test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%sql select * from order_tbl

 * sqlite:///./test.db
Done.

[('2015-05-01', 'ODR1', 'PROD1', 5, 5),
 ('2015-05-01', 'ODR2', 'PROD2', 2, 10),
 ('2015-05-01', 'ODR3', 'PROD3', 10, 25),
 ('2015-05-01', 'ODR4', 'PROD1', 20, 5),
 ('2015-05-02', 'ODR5', 'PROD3', 5, 25),
 ('2015-05-02', 'ODR6', 'PROD4', 6, 20),
 ('2015-05-02', 'ODR7', 'PROD1', 2, 5),
 ('2015-05-02', 'ODR8', 'PROD5', 1, 50),
 ('2015-05-02', 'ODR9', 'PROD6', 2, 50),
 ('2015-05-02', 'ODR10', 'PROD2', 4, 10)]

1. SQL to Display all the product that got sold on both the days and number of times the prodct is sold
2. SQL to get products that was ordered on 2-May-2015 but not on 1-May-2015

In [15]:
%%sql
select product_id,sum(sold_cnt) from (
select count(*) sold_cnt, product_id,order_day from order_tbl group by product_id,order_day)x
group by product_id
having count(*) > 1

 * sqlite:///./test.db
Done.

[('PROD1', 3), ('PROD2', 2), ('PROD3', 2)]

In [7]:
%%sql
select product_id,count(product_id) cnt,count(distinct order_day) cnt_order_day from order_tbl
group by product_id
having count(distinct order_day) > 1

 * sqlite:///./test.db
Done.

[('PROD1', 3, 2), ('PROD2', 2, 2), ('PROD3', 2, 2)]

In [14]:
%%sql 
select * from order_tbl where 
product_id not in (select distinct product_id from order_tbl where order_day='2015-05-01')

 * sqlite:///./test.db
Done.

[('2015-05-02', 'ODR6', 'PROD4', 6, 20),
 ('2015-05-02', 'ODR8', 'PROD5', 1, 50),
 ('2015-05-02', 'ODR9', 'PROD6', 2, 50)]